# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [2]:
# connection = sqlite3.connect('data.sqlite')
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)

In [3]:
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [26]:
#Your code here
cursor.execute('''
SELECT firstName, lastName FROM employees
JOIN offices ON employees.officeCode = offices.officeCode
WHERE offices.officeCode = "2"
''').fetchall()

# employees.officeCode = "2" also works

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [51]:
#Your code here
## No. Using the above code, and changing "2" to 1 through 7, you find no office is empty

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA

In [68]:
#Your code here
cursor.execute('''
SELECT firstName, lastName, employees.officeCode FROM employees
LEFT JOIN offices ON employees.officeCode = offices.officeCode
''')
df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.head(1)

## try to do this via dataframe & loop; aborted

  firstName lastName officeCode
0     Diane   Murphy          1

In [99]:
# freq = []
# for j in list(range(1,8)):
#     freq.append(0)

# code = []
# for k in list(range(1,8)):
#     code.append(k)
    
# employee_dict = dict(zip(code,freq))

# freq2 = []
# for l in df.officeCode:
#     employee_dict[1] += 1
    
# print(employee_dict)

{1: 23, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0}

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [102]:
# Your code here
## from sol key; adapted
cursor.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df2 = pd.DataFrame(cursor.fetchall())
print(len(df2))
df2.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [104]:
#Your code here
df2.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!